肥猫 2014/4/4 20:55:05
-----------------------------------------------------------------------
我们的项目时间要抓紧了！
做成勾选与通道功能，然后相同的图片可以共用，以材质名称的形式来调用修改

读出正确的3D场景内的材质名称很重要，按材质名称修改是必须的要功能
我正在做的车模，光材质种类就有一百多种

之间的贴图大量共用，调试效果时首先就是要根据材质名称来调试，而且要不停的更换不同的贴图

你仔细看一下SKETCHFAB

我觉得他们定位错了，3d展示这块肯定需要专业的人员来搞，开放给外面的人来做，效果差反而砸了自己的品牌

WEBGL说实质点其实已经是革命了,让传统的二维进入真正意义上的三维世界,
平台的开放需要等到相关人员的素质都达到了，可以做出相当成熟的产品与效果时，这个时候可以把平台给这些能力达到的人，这样即可以赚钱又不失品质

永远不要做牺牲品质的行为，我希望以后我们走的是逐步提价的路线
初期牺牲自己利益，让客户换取超价体验，让客户自己去帮你做宣传，业务饱和后就可以开始提价供应，这样走越到后面越是做高端客户，品牌价值才能凸现，而且利益名誉两收获！

我在微信上给你留言了，你觉得开发出直接FBX格式有哪些难度？直接用FBX格式上传

